controltheory/beamer/7/7_5_stability.tex
% Created 2016-11-30 Wed 11:29
\documentclass[table]{beamer}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\usepackage[usenames]{color}
\usepackage{pstricks}
\usepackage{pgfplots}
\pgfplotsset{compat=1.8}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<article>{\usepackage{beamerarticle}}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\mode<beamer>{\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}}
\setbeamercovered{transparent}
\subtitle{离散系统稳定性}
\providecommand{\alert}[1]{\textbf{#1}}

\title{线性离散系统分析}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}













\section{稳定性}
\label{sec-1}
\begin{frame}
\frametitle{S域到Z域的映射}
\label{sec-1-1}
\begin{columns}
\begin{column}{0.5\textwidth}
%% $S\leftrightarrow Z$
\label{sec-1-1-1}

\begin{eqnarray*}
z & = & e^{sT}\\
s &=& \sigma+j\omega \\
z &=& e^{\sigma T}e^{j\omega T} \\
|z| &=& e^{\sigma T} \\
\angle z &=& \omega T
\end{eqnarray*}
\begin{block}<2->{当  $\sigma=0$  时,}
\label{sec-1-1-1-1}

对应到  $z$  平面的单位圆,此时,  $\omega$  从  $-\infty\rightarrow\infty$ 时,  $z$  平面上的点己绕单位圆运动了无数圈,称  $[-\frac{\omega_s}{2},\frac{\omega_s}{2}]$  为主要带.
\end{block}
\end{column}
\begin{column}{0.5\textwidth}
\begin{block}<3->{主要映射关系:}
\label{sec-1-1-2}

\begin{itemize}
\item 等  $\sigma$  线: 圆:   $|z|=e^{\sigma T}$
\item 等  $\omega$  线: 过原点射线:  $\angle z=\omega T$
\item 等  $\xi$  线(S平面过原点射线): 对数螺线
\end{itemize}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{离散系统的稳定性}
\label{sec-1-2}

\begin{itemize}
\item 稳定性定义:离散系统在有界输入序列下,输出序列也有界.
\item <2->连续系统中:闭环系统的特征根实部 $\sigma$  小于0.
\item <3->离散系统中:  $|z|<1$ ,($|z|=e^{\sigma}$)
\begin{itemize}
\item 差分方程:特征根的模均小于1
\item 闭环脉冲传递函数:离散系统闭环特征根在Z平面的单位圆内($|z_i|<1$)
\end{itemize}
\end{itemize}
\end{frame}
\section{稳定性判据}
\label{sec-2}

\mode<article>{解特征方程,根据 $|z_i|<1$ 判断}
\begin{frame}
\frametitle{W域的劳斯判据}
\label{sec-2-1}

\begin{itemize}
\item Z域变换到W域:
      \begin{eqnarray*}
       z & = & x+jy\\
       w &= & u+jv \\
       z & = &\frac{w+1}{w-1} \\
       w &= & \frac{z+1}{z-1} \\
      \end{eqnarray*}
\item <2->等价关系:
      \begin{eqnarray*}
      u+jv &=& \frac{x^2+y^2-1-2yj}{(x-1)^2+y^2} \\
      |z|<1 &\Leftrightarrow& u<0 
      \end{eqnarray*}
\item <3->可在W域中使用Routh判据.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{W域的劳斯判据示例:}
\label{sec-2-2}


\begin{tikzpicture}[node distance=2.2em,auto,>=latex', thick]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[] (r) {$r(t)$}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$   $ ,right =of r] (p1) {}; 
\path[->](r) edge node {} (p1) ; 
\path[->] node[minimum size=2em,right =of p1] (s1) {}; 
\draw (s1.west)--(s1.north east);\draw[->] (s1.north west) arc (70:0:1.7em);\draw (s1.south) node {$T$};%\draw (s1.north) node[above] {$S$};
\path[](p1) edge node[midway] {$e(t)$} (s1) ; 
%\path[red,->] node[draw, inner sep=5pt,right =of s1] (g1) {$G_h(s)$}; 
%\path[->] (s1) edge node[midway] {$r^*(t)$} (g1); 
\path[red] node[draw, inner sep=5pt,right =of s1] (g2) {$\frac{k}{s(1+0.1s)}$}; 
\path[->] (s1) edge node[midway] {$e^*(t)$} (g2); 
\path[->] node[ right =of g2] (o) {$c(t)$}; 
\path[->] (g2) edge node {} (o); 
\path[->] node[minimum size=2em,above =of o] (sc) {}; 
\draw[dashed] (sc.west)--(sc.north east);\draw[dashed,->] (sc.north west) arc (70:0:1.7em);\draw[dashed] (sc.south) node {$T$};%\draw (sc.north) node[above] {$S$};
\path[dashed,draw](o.west)+(-1em,0) |- (sc.west) ; 
\path node[ right =of sc] (c) {$c^*(t)$}; 
\path[dashed,->] (sc) edge node {} (c); 
\path[red] node[ inner sep=5pt,below =of g2] (h) {$ $}; 
\path[draw] (g2.east)+(1em,0) |- (h.west);
\path[->,draw] (h.west) -| node [very near end] {$-$} (p1);
%\path[->, draw] (g.east)+(1em,0) -- +(1em,-3em) -| node[very near end] {$-$} (p1); 
\path[->] node[minimum size=2em,above =of p1] (sr) {}; 
\draw[dashed] (sr.west)--(sr.north east);\draw[dashed,->] (sr.north west) arc (70:0:1.7em);\draw[dashed] (sr.south) node {$T$};%\draw (sr.north) node[above] {$S$};
\path[dashed,draw](r.east)+(1em,0) |- (sr.west) ; 
\path node[ right =of sr] (i) {$r^*(t)$}; 
\path[dashed,->] (sr) edge node {} (i); 
\end{tikzpicture} 

分有无采样开关($T=0.1s$)两种情况分析使系统稳定的 $k$ 需要满足的条件.
\begin{block}<2->{解:}
\label{sec-2-2-1}

 无采样开关时:
  \[D(s)=0.1s^2+s+k\]
  得:  $k>0$ 
\end{block}
\end{frame}
\begin{frame}
\frametitle{W域的劳斯判据示例(续):有采样开关时:}
\label{sec-2-3}

\begin{eqnarray*}
G(z) &=  &{\cal Z}[\frac{k}{s(1+0.1s)}] 
  = \frac{0.632kz}{z^2-1.368z+0.368} \\
\Phi(z) &=& \frac{G(z)}{1+G(z)}
\end{eqnarray*}
\begin{eqnarray*}
D(z) &=& z^2+(0.632k-1.368)z+0.368\\
z &=& \frac{w+1}{w-1} \\
D(w) &=& 0.632kw^2+1.264w+(2.736-0.632k)
\end{eqnarray*}
\end{frame}
\begin{frame}
\frametitle{W域的劳斯判据示例(续):有采样开关时:}
\label{sec-2-4}

\begin{itemize}
\item Routh表:
     \[\begin{matrix}
     w^2 & 0.632k & 2.7360-0.632k \\
     w^1 & 1.264  & 0 \\
     w^0 & 2.736-0.632k
     \end{matrix}\]
\item 得:
     \begin{eqnarray*}
     0.632k &>  & 0\\
     2.736-0.632k& >& 0
     \end{eqnarray*}
\item 得:  
     \[0<k<4.33\]
\item <2->采样开关对稳定性有很大影响.
\end{itemize}
\end{frame}
\section{离散系统稳定性影响因素}
\label{sec-3}
\begin{frame}
\frametitle{离散系统稳定性影响因素}
\label{sec-3-1}

\begin{itemize}
\item <2->系统开环增益
\begin{itemize}
\item $k\uparrow$  则离散系统稳定性下降
\item $k\downarrow$  则离散系统稳定性提高
\end{itemize}
\item <3->采样周期
\begin{itemize}
\item $T\uparrow$  则离散系统稳定性下降
\item $T\downarrow$  则离散系统稳定性提高
\end{itemize}
\end{itemize}
\end{frame}

\end{document}
